fe40/tutorials/rheoFoam/Cavity/Oldroyd-BLog/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(p)"
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-10;
        relTol           0;
        minIter          0;
        maxIter          800;
        
    }

    "(theta|tau|U)"
    {

        solver           PBiCG;
        preconditioner
        {
            preconditioner DILU;
        }

        tolerance         1e-10;
        relTol            0;
        minIter           0;
        maxIter           1000;
    }
 
}

PostProcessing
{

functions
 (
 
  kineticE
   {
     funcType           calcKineticE;
     enabled            true;
     evaluateInterval   20;   
   }
   
 );
 
}

SIMPLE
{
    nInIter         1;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;

    residualControl
    {
      
    }
}

relaxationFactors
{
     fields
      {       
         p 1;
      }

     equations
      { 
         U 1;
         tau 1;
         theta 1;
      }
}

// ************************************************************************* //
